[
    {
        "name":"Minecraft",
        "content": "Ești un explorator curajos în Minecraft și tocmai ai primit o misiune de la Vrăjitorul Matemat! Trebuie să ordonezi o serie de blocuri cu numere pe ele, pentru a deschide Portalul Misterelor. Există două feluri de ordine pe care trebuie să le stăpânești:\n\n    Ordonarea crescătoare - numerele se așază de la cel mai mic la cel mai mare.\n    Ordonarea descrescătoare - numerele se așază de la cel mai mare la cel mai mic.\n\nDacă reușești, vei găsi Comoara Numerelor ascunsă dincolo de portal!\n\nCum ordonăm numerele?\n\n1. Ordonare Crescătoare: Blocurile de Diamant\n\nVrăjitorul Matemat ți-a dat blocuri de diamant numerotate. Dacă le așezi în ordinea corectă, poți construi Scara Diamantului care te va duce către primul indiciu al comorii!\n\n    Imaginează-ți că ai blocuri cu numerele 3, 7, 1, 10, 5.\n    Pentru a construi scara diamantului, trebuie să începi de la cel mai mic număr și să urci până la cel mai mare.\n    Ordonare crescătoare: 1, 3, 5, 7, 10.\n\nSteve începe să urce pe scara diamantului de la blocul 1 și ajunge la blocul 10! Felicitări, ai terminat prima parte a misiunii!\n\n2. Ordonare Descrescătoare: Blocurile de Aur\n\nVrăjitorul Matemat ți-a dat și blocuri de aur cu numere pe ele. Dacă le așezi în ordine descrescătoare, poți construi Podul de Aur care te duce către un nou indiciu!\n\n    Imaginează-ți că ai blocurile numerotate: 9, 2, 6, 11, 4.\n    Pentru a construi podul de aur, așază blocurile în ordine descrescătoare, de la cel mai mare la cel mai mic.\n    Ordonare descrescătoare: 11, 9, 6, 4, 2.\n\nSteve începe de la blocul 11 și coboară până la blocul 2. Ai reușit să construiești și podul!\n\nJoc Practic: Construiește-ți Comoara!\n\n    Găsește blocurile magice - Alege cinci numere și notează-le. Apoi încearcă să le ordonezi în două feluri:\n        În ordine crescătoare: imaginează-ți că urci scara blocurilor.\n        În ordine descrescătoare: imaginează-ți că cobori o scară.\n\n    Rezolvă Enigmele - Ordonează următoarele seturi de numere pentru a dezlega misterul:\n        Blocurile de diamant: 7, 3, 10, 2, 8 (ordine crescătoare).\n        Blocurile de aur: 12, 5, 8, 1, 9 (ordine descrescătoare).\n\n    Bonus - Portalul Numerelor - Dacă ai două portaluri în fața ta, unul se deschide doar cu numere în ordine crescătoare, iar altul doar cu numere în ordine descrescătoare. Găsește seturile potrivite de numere și alege portalul corect!\n\nAcum că ai învățat să ordonezi numerele în stil Minecraft, ești pregătit să deschizi Portalul Misterelor și să găsești comoara. Succes, aventurierule!",
        "lesson_id": 1
    },
    {
        "name":"Fortnite",
        "content": "Ești un luptător curajos în Fortnite și tocmai ai primit o misiune de la Maestrul Strategiei! Trebuie să ordonezi o serie de arme cu numere pe ele, pentru a deschide Portalul Bătăliei. Există două feluri de ordine pe care trebuie să le stăpânești:\n\n    Ordonarea crescătoare - armele se așază de la cea mai slabă la cea mai puternică.\n    Ordonarea descrescătoare - armele se așază de la cea mai puternică la cea mai slabă. Dacă reușești, vei găsi Comoara Bătăliei ascunsă dincolo de portal!\n\nCum ordonăm armele?\n\n    Ordonare Crescătoare: Armele de Fier Maestrul Strategiei ți-a dat arme de fier numerotate. Dacă le așezi în ordinea corectă, poți construi Scara Victoriei care te va duce către primul indiciu al comorii! • Imaginează-ți că ai arme cu numerele 4, 2, 9, 5, 1. • Pentru a construi scara victoriei, trebuie să începi de la cea mai slabă armă și să urci până la cea mai puternică. • Ordonare crescătoare: 1, 2, 4, 5, 9. Ești gata să urci pe scara victoriei de la arma 1 și să ajungi la arma 9! Felicitări, ai terminat prima parte a misiunii!\n\n    Ordonare Descrescătoare: Armele Legendare Maestrul Strategiei ți-a dat și arme legendare cu numere pe ele. Dacă le așezi în ordine descrescătoare, poți construi Podul Gloriei care te duce către un nou indiciu! • Imaginează-ți că ai armele numerotate: 15, 8, 10, 12, 3. • Pentru a construi podul gloriei, așază armele în ordine descrescătoare, de la cea mai puternică la cea mai slabă. • Ordonare descrescătoare: 15, 12, 10, 8, 3. Ești gata să traversezi podul gloriei de la arma 15 și să cobori până la arma 3. Ai reușit să construiești și podul!\n\nJoc Practic: Găsește-ți Comoara!\n\n    Găsește armele magice - Alege cinci numere și notează-le. Apoi încearcă să le ordonezi în două feluri: ◦ În ordine crescătoare: imaginează-ți că urci scara armelor. ◦ În ordine descrescătoare: imaginează-ți că cobori o scară.\n    Rezolvă Enigmele - Ordonează următoarele seturi de numere pentru a dezlega misterul: ◦ Armele de fier: 6, 1, 5, 3, 7 (ordine crescătoare). ◦ Armele legendare: 20, 14, 18, 11, 9 (ordine descrescătoare).\n    Bonus - Portalul Bătăliei - Dacă ai două portaluri în fața ta, unul se deschide doar cu numere în ordine crescătoare, iar altul doar cu numere în ordine descrescătoare. Găsește seturile potrivite de numere și alege portalul corect!\n\nAcum că ai învățat să ordonezi armele în stil Fortnite, ești pregătit să deschizi Portalul Bătăliei și să găsești comoara. Succes, aventurierule!",
        "lesson_id" : 1
    },
    {
        "name":"Roblox",
        "content": "Ești un aventurier curajos în Roblox și tocmai ai primit o misiune de la Maestrul Construcțiilor! Trebuie să ordonezi o serie de blocuri cu numere pe ele, pentru a deschide Portalul Creativității. Există două feluri de ordine pe care trebuie să le stăpânești:\n\n    Ordonarea crescătoare - blocurile se așază de la cel mai mic la cel mai mare.\n    Ordonarea descrescătoare - blocurile se așază de la cel mai mare la cel mai mic. Dacă reușești, vei găsi Comoara Creativității ascunsă dincolo de portal!\n\nCum ordonăm blocurile?\n\n    Ordonare Crescătoare: Blocurile de Lemn Maestrul Construcțiilor ți-a dat blocuri de lemn numerotate. Dacă le așezi în ordinea corectă, poți construi Scara Creativității care te va duce către primul indiciu al comorii! • Imaginează-ți că ai blocuri cu numerele 4, 2, 9, 5, 1. • Pentru a construi scara creativității, trebuie să începi de la cel mai mic bloc și să urci până la cel mai mare. • Ordonare crescătoare: 1, 2, 4, 5, 9. Ești gata să urci pe scara creativității de la blocul 1 și să ajungi la blocul 9! Felicitări, ai terminat prima parte a misiunii!\n\n    Ordonare Descrescătoare: Blocurile Legendare Maestrul Construcțiilor ți-a dat și blocuri legendare cu numere pe ele. Dacă le așezi în ordine descrescătoare, poți construi Podul Gloriei care te duce către un nou indiciu! • Imaginează-ți că ai blocurile numerotate: 15, 8, 10, 12, 3. • Pentru a construi podul gloriei, așază blocurile în ordine descrescătoare, de la cel mai mare la cel mai mic. • Ordonare descrescătoare: 15, 12, 10, 8, 3. Ești gata să traversezi podul gloriei de la blocul 15 și să cobori până la blocul 3. Ai reușit să construiești și podul!\n\nJoc Practic: Găsește-ți Comoara!\n\n    Găsește blocurile magice - Alege cinci numere și notează-le. Apoi încearcă să le ordonezi în două feluri: ◦ În ordine crescătoare: imaginează-ți că urci scara blocurilor. ◦ În ordine descrescătoare: imaginează-ți că cobori o scară.\n    Rezolvă Enigmele - Ordonează următoarele seturi de numere pentru a dezlega misterul: ◦ Blocurile de lemn: 6, 1, 5, 3, 7 (ordine crescătoare). ◦ Blocurile legendare: 20, 14, 18, 11, 9 (ordine descrescătoare).\n    Bonus - Portalul Creativității - Dacă ai două portaluri în fața ta, unul se deschide doar cu numere în ordine crescătoare, iar altul doar cu numere în ordine descrescătoare. Găsește seturile potrivite de numere și alege portalul corect!\n\nAcum că ai învățat să ordonezi blocurile în stil Roblox, ești pregătit să deschizi Portalul Creativității și să găsești comoara. Succes, aventurierule!",
        "lesson_id": 1
    },
    {
        "name":"Minecraft",
        "content": "FACTOR COMUN ÎN STIL MINECRAFT\n\nImaginează-ți că ai de construit structuri în Minecraft folosind același tip de bloc (de exemplu, blocuri de lemn). Dacă folosești blocuri de lemn în mai multe locuri, le poți grupa, numindu-le factor comun și organizând mai eficient construcțiile.\n\nCe este FACTORUL COMUN?\n\nÎn construcția noastră, factor comun este blocul pe care îl folosim de mai multe ori, ca un bloc „comun” între diferite părți ale construcției. De exemplu, în expresia a∙b + a∙c, blocul a este folosit la ambele construcții, deci este un factor comun.\n\nProprietăți ale FACTORULUI COMUN: DISTRIBUTIVITATEA\n\nDistributivitatea înmulțirii față de adunare ne spune că, dacă avem de construit două structuri separate, dar folosim același tip de bloc în ambele, putem economisi blocurile „scoțând” factorul comun.\n\nExemplu:\n\nDacă avem a∙b + a∙c, putem grupa blocul comun a:\n    • Expresia a∙(b + c) înseamnă că blocul a este multiplicat de b + c și reprezintă o construcție unică.\n\nAcelași lucru se aplică și pentru distributivitatea înmulțirii față de scădere.\n\nExemplu:\n    • Dacă avem a∙b - a∙c, putem organiza blocul comun a astfel: a∙(b - c). Înseamnă că folosim blocul a de b - c ori.\n\nEXEMPLU ÎN MINECRAFT\n\nImaginăm că ai:\n    • a blocuri de lemn.\n    • b bucăți de piatră.\n    • c bucăți de nisip.\n\nÎn loc să construiești două structuri separate de a blocuri de lemn cu b blocuri de piatră și a blocuri de lemn cu c blocuri de nisip, folosești distributivitatea și construiești totul ca o singură structură de a blocuri de lemn cu (b + c) materiale mixte.\n\nAstfel, factorul comun este ca blocul universal în construcții, economisind materiale și simplificând structura!",
        "lesson_id": 2
    },
    {
        "name":"Fortnite",
        "content": "FACTOR COMUN ÎN STIL FORTNITE\n\nImaginează-ți că ai de construit structuri în Fortnite folosind același tip de material (de exemplu, lemn). Dacă folosești lemn în mai multe locuri, le poți grupa, numindu-le factor comun și organizând mai eficient construcțiile tale.\n\nCe este FACTORUL COMUN?\n\nÎn construcția noastră, factor comun este materialul pe care îl folosești de mai multe ori, ca un material „comun” între diferite părți ale construcției. De exemplu, în expresia a∙b + a∙c, materialul a este folosit la ambele construcții, deci este un factor comun.\n\nProprietăți ale FACTORULUI COMUN: DISTRIBUTIVITATEA\n\nDistributivitatea înmulțirii față de adunare ne spune că, dacă avem de construit două structuri separate, dar folosim același tip de material în ambele, putem economisi resursele „scoțând” factorul comun.\n\nExemplu:\n\nDacă avem a∙b + a∙c, putem grupa materialul comun a:\n    • Expresia a∙(b + c) înseamnă că materialul a este multiplicat de b + c și reprezintă o construcție unică.\n\nAcelași lucru se aplică și pentru distributivitatea înmulțirii față de scădere.\n\nExemplu:\n    • Dacă avem a∙b - a∙c, putem organiza materialul comun a astfel: a∙(b - c). Înseamnă că folosești materialul a de b - c ori.\n\nEXEMPLU ÎN FORTNITE\n\nImaginăm că ai:\n    • a blocuri de lemn.\n    • b ziduri de piatră.\n    • c ziduri de metal.\n\nÎn loc să construiești două structuri separate de a blocuri de lemn cu b ziduri de piatră și a blocuri de lemn cu c ziduri de metal, folosești distributivitatea și construiești totul ca o singură structură de a blocuri de lemn cu (b + c) materiale mixte.\n\nAstfel, factorul comun este ca materialul universal în construcții, economisind resurse și simplificând structura!",
        "lesson_id":2
    },
    {
        "name":"Roblox",
        "content": "FACTOR COMUN ÎN STIL ROBLOX\n\nImaginează-ți că ai de construit structuri în Roblox folosind același tip de bloc (de exemplu, blocuri de piatră). Dacă folosești blocuri de piatră în mai multe locuri, le poți grupa, numindu-le factor comun și organizând mai eficient construcțiile tale.\n\nCe este FACTORUL COMUN?\n\nÎn construcția noastră, factor comun este blocul pe care îl folosești de mai multe ori, ca un bloc „comun” între diferite părți ale construcției. De exemplu, în expresia a∙b + a∙c, blocul a este folosit la ambele construcții, deci este un factor comun.\n\nProprietăți ale FACTORULUI COMUN: DISTRIBUTIVITATEA\n\nDistributivitatea înmulțirii față de adunare ne spune că, dacă avem de construit două structuri separate, dar folosim același tip de bloc în ambele, putem economisi blocurile „scoțând” factorul comun.\n\nExemplu:\n\nDacă avem a∙b + a∙c, putem grupa blocul comun a:\n    • Expresia a∙(b + c) înseamnă că blocul a este multiplicat de b + c și reprezintă o construcție unică.\n\nAcelași lucru se aplică și pentru distributivitatea înmulțirii față de scădere.\n\nExemplu:\n    • Dacă avem a∙b - a∙c, putem organiza blocul comun a astfel: a∙(b - c). Înseamnă că folosești blocul a de b - c ori.\n\nEXEMPLU ÎN ROBLOX\n\nImaginăm că ai:\n    • a blocuri de piatră.\n    • b blocuri de lemn.\n    • c blocuri de metal.\n\nÎn loc să construiești două structuri separate de a blocuri de piatră cu b blocuri de lemn și a blocuri de piatră cu c blocuri de metal, folosești distributivitatea și construiești totul ca o singură structură de a blocuri de piatră cu (b + c) materiale mixte.\n\nAstfel, factorul comun este ca blocul universal în construcții, economisind materiale și simplificând structura!",
        "lesson_id":2
    },
    {
        "name":"Minecraft",
        "content": "Imaginăm că în Minecraft există un bloc magic care își poate multiplica puterea, asemenea unui power-up.\n\nAceasta este puterea blocului, iar când adăugăm mai multă putere blocului, îi creștem exponentul!\n\nCOMPARAREA PUTERILOR În Minecraft, avem mai multe blocuri de același tip, dar unele sunt mai puternice decât altele.\n\nDacă două blocuri au aceeași bază (de exemplu, două blocuri de diamant), atunci blocul cu exponentul mai mare este mai puternic!\n\nCu cât exponentul e mai mare, cu atât blocul este mai puternic și valoros. Exemplu: Diamant^3 este mai puternic decât Diamant^2.\n\nDacă ai două blocuri de diamant cu exponenți diferiți, Diamant^5 va fi mai valoros decât Diamant^4.\n\nPĂTRAT PERFECT - STRUCTURI PĂTRATE ÎN MINECRAFT Un pătrat perfect poate fi imaginat ca o construcție pătrată în Minecraft.\n\nDacă ai un număr de blocuri și le poți aranja perfect într-o structură pătrată, înseamnă că numărul de blocuri este un pătrat perfect.\n\nExemplu:Dacă ai 16 blocuri, le poți aranja într-un pătrat de 4x4 blocuri(pentru că 4 la puterea a 2-a = 16). Numărul 16 este un pătrat perfect, deoarece 16 = 4^2.\n\nCUB PERFECT - STRUCTURI CUBICE ÎN MINECRAFT Un cub perfect este ca o construcție cubică din Minecraft.\n\nDacă ai un număr de blocuri pe care le poți aranja perfect într-o structură cubică, înseamnă că numărul acela de blocuri este un cub perfect.\n\n Exemplu: Dacă ai 27 blocuri, le poți aranja într-un cub de 3x3x3 blocuri (pentru că 3 la puterea\na 3-a = 27).\n\n Numărul 27 este un cub perfect, deoarece 27 = 3^3.\n\n RECAPITULARE RAPIDĂ ÎN STIL MINECRAFT 1. Bază și exponent:\nGândește-te la baza unui bloc (de exemplu, Diamant) și exponentul\nsău (nivelul de putere). Diamant^4 este mai valoros decât\nDiamant^2.\n\n 2. Pătrat perfect: Numărul de blocuri care pot fi\naranjate perfect într-un pătrat. (Exemplu: 4x4 = 16 blocuri).\n\n3. Cub perfect: Numărul de blocuri care pot fi aranjate perfect\nîntr-un cub. (Exemplu: 3x3x3 = 27 blocuri).\n\nAcum poți folosi aceste concepte matematice pentru a crea structuri și mai impresionante în Minecraft! Spor la construit și la învățat!\n\n",
        "lesson_id": 3
    },
    {
        "name":"Fortnite",
        "content": "Introducere\n\nBun venit, aventurieri! Astăzi vom explora concepte matematice interesante folosind tema Fortnite. Imaginați-vă că în Fortnite există blocuri magice care pot fi îmbunătățite cu power-up-uri, exact ca în joc! Aceste blocuri au o putere reprezentată printr-o bază și un exponent, care ne ajută să le comparăm și să construim structuri fantastice.\n\nCOMPARAREA PUTERILOR\n\nÎn Fortnite, avem diferite tipuri de blocuri, iar unele sunt mai puternice decât altele. Dacă două blocuri au aceeași bază (de exemplu, două blocuri de fier), atunci blocul cu exponentul mai mare este mai puternic!\n\nExemplu:\n\n    Fier^3 este mai puternic decât Fier^2.\n    Dacă ai două blocuri de fier cu exponenți diferiți, Fier^5 va fi mai valoros decât Fier^4.\n\nPĂTRAT PERFECT - STRUCTURI PĂTRATE ÎN FORTNITE\n\nImaginați-vă că un pătrat perfect este o construcție pătrată în Fortnite. Dacă aveți un număr de blocuri și le puteți aranja perfect într-o structură pătrată, înseamnă că numărul de blocuri este un pătrat perfect.\n\nExemplu:\n\n    Dacă ai 16 blocuri, le poți aranja într-un pătrat de 4x4 blocuri (pentru că 4 la puterea a 2-a = 16).\n    Numărul 16 este un pătrat perfect, deoarece 16 = 4^2.\n\nCUB PERFECT - STRUCTURI CUBICE ÎN FORTNITE\n\nUn cub perfect este ca o construcție cubică din Fortnite. Dacă ai un număr de blocuri pe care le poți aranja perfect într-o structură cubică, înseamnă că numărul acela de blocuri este un cub perfect.\n\nExemplu:\n\n    Dacă ai 27 blocuri, le poți aranja într-un cub de 3x3x3 blocuri (pentru că 3 la puterea a 3-a = 27).\n    Numărul 27 este un cub perfect, deoarece 27 = 3^3.\n\nRECAPITULARE RAPIDĂ ÎN STIL FORTNITE\n\n    Bază și exponent: Gândește-te la baza unui bloc (de exemplu, Fier) și exponentul său (nivelul de putere). Fier^4 este mai valoros decât Fier^2.\n\n    Pătrat perfect: Numărul de blocuri care pot fi aranjate perfect într-un pătrat. (Exemplu: 4x4 = 16 blocuri).\n\n    Cub perfect: Numărul de blocuri care pot fi aranjate perfect într-un cub. (Exemplu: 3x3x3 = 27 blocuri).\n\nActivitate Practică\n\nAcum, este timpul să folosiți aceste concepte matematice pentru a crea structuri și mai impresionante în Fortnite! Luați un set de blocuri (fie ele de hârtie, cuburi sau chiar blocuri de construcție) și încercați să construiți:\n\n    O structură pătrată folosind un număr de blocuri care este un pătrat perfect.\n    O structură cubică folosind un număr de blocuri care este un cub perfect.\n\nConcluzie\n\nSpor la construit și la învățat! Folosiți aceste concepte pentru a deveni cei mai buni constructori din Fortnite și nu uitați să vă distrați în timpul procesului!",
        "lesson_id": 3
    },
    {
        "name":"Roblox",
        "content": "Introducere\n\nBun venit, aventurieri din Roblox! Astăzi vom explora concepte matematice interesante folosind tema Roblox. Imaginați-vă că în Roblox există blocuri magice care pot fi folosite pentru a construi cele mai fantastice lumi. Aceste blocuri au o putere reprezentată printr-o bază și un exponent, care ne ajută să le comparăm și să construim structuri uimitoare.\n\nCOMPARAREA PUTERILOR\n\nÎn Roblox, avem diferite tipuri de blocuri, iar unele sunt mai puternice decât altele. Dacă două blocuri au aceeași bază (de exemplu, două blocuri de lemn), atunci blocul cu exponentul mai mare este mai puternic!\n\nExemplu:\n\n    Lemn^3 este mai puternic decât Lemn^2.\n    Dacă ai două blocuri de lemn cu exponenți diferiți, Lemn^5 va fi mai valoros decât Lemn^4.\n\nPĂTRAT PERFECT - STRUCTURI PĂTRATE ÎN ROBLOX\n\nImaginați-vă că un pătrat perfect este o construcție pătrată în Roblox. Dacă aveți un număr de blocuri și le puteți aranja perfect într-o structură pătrată, înseamnă că numărul de blocuri este un pătrat perfect.\n\nExemplu:\n\n    Dacă ai 25 blocuri, le poți aranja într-un pătrat de 5x5 blocuri (pentru că 5 la puterea a 2-a = 25).\n    Numărul 25 este un pătrat perfect, deoarece 25 = 5^2.\n\nCUB PERFECT - STRUCTURI CUBICE ÎN ROBLOX\n\nUn cub perfect este ca o construcție cubică din Roblox. Dacă ai un număr de blocuri pe care le poți aranja perfect într-o structură cubică, înseamnă că numărul acela de blocuri este un cub perfect.\n\nExemplu:\n\n    Dacă ai 64 blocuri, le poți aranja într-un cub de 4x4x4 blocuri (pentru că 4 la puterea a 3-a = 64).\n    Numărul 64 este un cub perfect, deoarece 64 = 4^3.\n\nRECAPITULARE RAPIDĂ ÎN STIL ROBLOX\n\n    Bază și exponent: Gândește-te la baza unui bloc (de exemplu, Lemn) și exponentul său (nivelul de putere). Lemn^4 este mai valoros decât Lemn^2.\n\n    Pătrat perfect: Numărul de blocuri care pot fi aranjate perfect într-un pătrat. (Exemplu: 5x5 = 25 blocuri).\n\n    Cub perfect: Numărul de blocuri care pot fi aranjate perfect într-un cub. (Exemplu: 4x4x4 = 64 blocuri).\n\nActivitate Practică\n\nAcum, este timpul să folosiți aceste concepte matematice pentru a crea structuri și mai impresionante în Roblox! Luați un set de blocuri (fie ele de hârtie, cuburi sau chiar blocuri de construcție) și încercați să construiți:\n\n    O structură pătrată folosind un număr de blocuri care este un pătrat perfect.\n    O structură cubică folosind un număr de blocuri care este un cub perfect.\n\nConcluzie\n\nSpor la construit și la învățat! Folosiți aceste concepte pentru a deveni cei mai buni constructori din Roblox și nu uitați să vă distrați în timpul procesului!",
        "lesson_id": 3
    }
]