[
    {
        "name":"Minecraft",
        "content": "Ești un explorator curajos în Minecraft și tocmai ai primit o misiune de la Vrăjitorul Matemat! Trebuie să ordonezi o serie de blocuri cu numere pe ele, pentru a deschide Portalul Misterelor. Există două feluri de ordine pe care trebuie să le stăpânești:\n\n    Ordonarea crescătoare - numerele se așază de la cel mai mic la cel mai mare.\n    Ordonarea descrescătoare - numerele se așază de la cel mai mare la cel mai mic.\n\nDacă reușești, vei găsi Comoara Numerelor ascunsă dincolo de portal!\n\nCum ordonăm numerele?\n\n1. Ordonare Crescătoare: Blocurile de Diamant\n\nVrăjitorul Matemat ți-a dat blocuri de diamant numerotate. Dacă le așezi în ordinea corectă, poți construi Scara Diamantului care te va duce către primul indiciu al comorii!\n\n    Imaginează-ți că ai blocuri cu numerele 3, 7, 1, 10, 5.\n    Pentru a construi scara diamantului, trebuie să începi de la cel mai mic număr și să urci până la cel mai mare.\n    Ordonare crescătoare: 1, 3, 5, 7, 10.\n\nSteve începe să urce pe scara diamantului de la blocul 1 și ajunge la blocul 10! Felicitări, ai terminat prima parte a misiunii!\n\n2. Ordonare Descrescătoare: Blocurile de Aur\n\nVrăjitorul Matemat ți-a dat și blocuri de aur cu numere pe ele. Dacă le așezi în ordine descrescătoare, poți construi Podul de Aur care te duce către un nou indiciu!\n\n    Imaginează-ți că ai blocurile numerotate: 9, 2, 6, 11, 4.\n    Pentru a construi podul de aur, așază blocurile în ordine descrescătoare, de la cel mai mare la cel mai mic.\n    Ordonare descrescătoare: 11, 9, 6, 4, 2.\n\nSteve începe de la blocul 11 și coboară până la blocul 2. Ai reușit să construiești și podul!\n\nJoc Practic: Construiește-ți Comoara!\n\n    Găsește blocurile magice - Alege cinci numere și notează-le. Apoi încearcă să le ordonezi în două feluri:\n        În ordine crescătoare: imaginează-ți că urci scara blocurilor.\n        În ordine descrescătoare: imaginează-ți că cobori o scară.\n\n    Rezolvă Enigmele - Ordonează următoarele seturi de numere pentru a dezlega misterul:\n        Blocurile de diamant: 7, 3, 10, 2, 8 (ordine crescătoare).\n        Blocurile de aur: 12, 5, 8, 1, 9 (ordine descrescătoare).\n\n    Bonus - Portalul Numerelor - Dacă ai două portaluri în fața ta, unul se deschide doar cu numere în ordine crescătoare, iar altul doar cu numere în ordine descrescătoare. Găsește seturile potrivite de numere și alege portalul corect!\n\nAcum că ai învățat să ordonezi numerele în stil Minecraft, ești pregătit să deschizi Portalul Misterelor și să găsești comoara. Succes, aventurierule!",
        "lesson_id": 1
    },
    {
        "name":"Minecraft",
        "content" : "Imaginăm că în Minecraft există un bloc magic care își poate multiplica\nputerea, asemenea unui power-up. Aceasta este puterea blocului, iar când\nadăugăm mai multă putere blocului, îi creștem exponentul! COMPARAREA\nPUTERILOR În Minecraft, avem mai multe blocuri de același tip, dar\nunele sunt mai puternice decât altele. Dacă două blocuri au aceeași\nbază (de exemplu, două blocuri de diamant), atunci blocul cu\nexponentul mai mare este mai puternic! Cu cât exponentul e mai mare,\ncu atât blocul este mai puternic și valoros. Exemplu: Diamant^3\neste mai puternic decât Diamant^2. Dacă ai două blocuri de diamant\ncu exponenți diferiți, Diamant^5 va fi mai valoros decât Diamant^4.\nPĂTRAT PERFECT - STRUCTURI PĂTRATE ÎN MINECRAFT Un pătrat perfect\npoate fi imaginat ca o construcție pătrată în Minecraft. Dacă ai un\nnumăr de blocuri și le poți aranja perfect într-o structură pătrată,\nînseamnă că numărul de blocuri este un pătrat perfect. Exemplu:\nDacă ai 16 blocuri, le poți aranja într-un pătrat de 4x4 blocuri\n(pentru că 4 la puterea a 2-a = 16). Numărul 16 este un pătrat\nperfect, deoarece 16 = 4^2. CUB PERFECT - STRUCTURI CUBICE ÎN\nMINECRAFT Un cub perfect este ca o construcție cubică din Minecraft.\nDacă ai un număr de blocuri pe care le poți aranja perfect\nîntr-o structură cubică, înseamnă că numărul acela de blocuri\neste un cub perfect. Exemplu: Dacă ai 27 blocuri, le poți\naranja într-un cub de 3x3x3 blocuri (pentru că 3 la puterea\na 3-a = 27). Numărul 27 este un cub perfect, deoarece 27 =\n3^3. RECAPITULARE RAPIDĂ ÎN STIL MINECRAFT 1. Bază și exponent:\nGândește-te la baza unui bloc (de exemplu, Diamant) și exponentul\nsău (nivelul de putere). Diamant^4 este mai valoros decât\nDiamant^2. 2. Pătrat perfect: Numărul de blocuri care pot fi\naranjate perfect într-un pătrat. (Exemplu: 4x4 = 16 blocuri).\n3. Cub perfect: Numărul de blocuri care pot fi aranjate perfect\nîntr-un cub. (Exemplu: 3x3x3 = 27 blocuri). Acum poți folosi\naceste concepte matematice pentru a crea structuri și mai\nimpresionante în Minecraft! Spor la construit și la învățat!",
        "lesson_id": 2
    }
]